KingKoro/CH32VX-UART-PIO-Library/lib/CH32V_UART/ch32v_uart.c
#if !defined(CH32V00X)
/*********************************************************************
 * @fn      USART2_IRQHandler
 *
 * @brief   This function handles USART2 global interrupt request.
 *
 * @return  none
 */
void USART2_IRQHandler(void)
{
    if(USART_GetITStatus(USART2, USART_IT_RXNE) != RESET)
    {
        #if (UART_RX_HALT_FULL == FALSE)
            RxBuffer[RxWritePtr[1]++] = (uint8_t)USART_ReceiveData(USART2);
        #else
            if (RxFill[1] < UART_RX_BUFSIZE)
            {
                RxBuffer[RxWritePtr[1]++] = (uint8_t)USART_ReceiveData(USART2);
                RxFill[1]++;
            }
        #endif

        if (RxWritePtr[1] >= ADDR_RX_BUF(1, UART_RX_BUFSIZE))      // Handle Write Buffer overflow, use constants for best performance
        {
            RxWritePtr[1] = ADDR_RX_BUF(1, 0);
        }
        USART_ClearITPendingBit(USART2, USART_IT_RXNE);
    }
}

/*********************************************************************
 * @fn      USART3_IRQHandler
 *
 * @brief   This function handles USART3 global interrupt request.
 *
 * @return  none
 */
void USART3_IRQHandler(void)
{
    if(USART_GetITStatus(USART3, USART_IT_RXNE) != RESET)
    {
        #if (UART_RX_HALT_FULL == FALSE)
            RxBuffer[RxWritePtr[2]++] = (uint8_t)USART_ReceiveData(USART3);
        #else
            if (RxFill[2] < UART_RX_BUFSIZE)
            {
                RxBuffer[RxWritePtr[2]++] = (uint8_t)USART_ReceiveData(USART3);
                RxFill[2]++;
            }
        #endif

        if (RxWritePtr[2] >= ADDR_RX_BUF(2, UART_RX_BUFSIZE))      // Handle Write Buffer overflow, use constants for best performance
        {
            RxWritePtr[2] = ADDR_RX_BUF(2, 0);
        }
        USART_ClearITPendingBit(USART3, USART_IT_RXNE);
    }
}

#if !defined(CH32V10X)
/*********************************************************************
 * @fn      USART4_IRQHandler
 *
 * @brief   This function handles USART4 global interrupt request.
 *
 * @return  none
 */
void USART4_IRQHandler(void)
{
    if(USART_GetITStatus(USART4, USART_IT_RXNE) != RESET)
    {
        #if (UART_RX_HALT_FULL == FALSE)
            RxBuffer[RxWritePtr[3]++] = (uint8_t)USART_ReceiveData(USART4);
        #else
            if (RxFill[3] < UART_RX_BUFSIZE)
            {
                RxBuffer[RxWritePtr[3]++] = (uint8_t)USART_ReceiveData(USART4);
                RxFill[3]++;
            }
        #endif

        if (RxWritePtr[3] >= ADDR_RX_BUF(3, UART_RX_BUFSIZE))      // Handle Write Buffer overflow, use constants for best performance
        {
            RxWritePtr[3] = ADDR_RX_BUF(3, 0);
        }
        USART_ClearITPendingBit(USART4, USART_IT_RXNE);
    }
}

#endif
#endif